app/views/users/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
Reviewed Beers:
<% user_reviews = Review.where(user_id: @user) %>

SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<% user_reviews.each do |review| %>
<% beer = Beer.find_by(id: review.beer_id) %>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 1]]
---
Tracked Beers:
<% user_reviews = Review.where(user_id: @user) %>

SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<% tracked_reviews.each do |review| %>
<% beer = Beer.find_by(id: review.beer_id) %>