app/views/breweries/by_city.html.erb


<% breweries = Brewery.select(:id, :city, :name).distinct%>
---
SELECT DISTINCT "breweries"."id", "breweries"."city", "breweries"."name" FROM "breweries"