app/views/breweries/index.html.erb

SELECT "breweries".* FROM "breweries"
---
<%= form_for @brewery do |f| %>
<%= f.collection_select(:name, Brewery.all, :id, :name) %>

SELECT "breweries".* FROM "breweries"
---
<%= form_for @brewery do |f| %>
<%= f.collection_select(:name, Brewery.all, :id, :city) %>

SELECT "breweries".* FROM "breweries"
---
<%= form_for @brewery do |f| %>
<%= f.collection_select(:name, Brewery.all, :id, :zip_code) %>