app/views/breweries/index.html.erb


<% breweries = Brewery.select(:id, :name).distinct%>
---
SELECT DISTINCT "breweries"."id", "breweries"."name" FROM "breweries"