app/views/breweries/show.html.erb


Beers Sold:<% brewery = Brewery.find_by(id: @brewery) %>
<ul><% brewery.beers.each do |beer| %>
---
SELECT "beer_breweries".* FROM "beer_breweries" WHERE "beer_breweries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "breweries".* FROM "breweries" WHERE "breweries"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "beers".* FROM "beers" INNER JOIN "beer_breweries" ON "beers"."id" = "beer_breweries"."beer_id" WHERE "beer_breweries"."brewery_id" = ?  [["brewery_id", 2]]