app/views/beers/new.html.erb

SELECT "breweries".* FROM "breweries"
---
    <br>
    <%= f.collection_check_boxes(:id, Brewery.all, :id, :name)%>