app/views/beers/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."beer_id" = ?  [["beer_id", 1]]
---
<h2>Reviews </h2>
<% @beer.reviews.each do |r| %> <br>