app/controllers/beers_controller.rb

  def index
    @beers = Beer.first
---
SELECT "beers".* FROM "beers" ORDER BY "beers"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def create
      @beer = Beer.new(beer_params)
       if @beer.valid?
        @beer.save
---
INSERT INTO "beers" ("name", "brand", "style", "abv", "strength", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Test Beer"], ["brand", "ABC Beer"], ["style", "Lager"], ["abv", 4.5], ["strength", "Light"], ["created_at", "2020-03-05 16:12:20.444434"], ["updated_at", "2020-03-05 16:12:20.444434"]]

  def show
    @beer = Beer.find(params[:id])
---
SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def like_beer
    @beer = Beer.find(params[:id])
---
SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]