app/controllers/breweries_controller.rb

  def create
    @brewery = Brewery.new(brewery_params)
    if @brewery.valid?
      @brewery.save
---
INSERT INTO "breweries" ("name", "address", "city", "zip_code", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Brew People"], ["address", "12 Brew Lane"], ["city", "New York City"], ["zip_code", 99999], ["created_at", "2020-03-05 17:03:54.719045"], ["updated_at", "2020-03-05 17:03:54.719045"]]

  def show
    @brewery = Brewery.find(params[:id])
---
SELECT "beer_breweries".* FROM "beer_breweries" WHERE "beer_breweries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "breweries".* FROM "breweries" WHERE "breweries"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]