app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("content", "rating", "tracked", "user_id", "beer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["content", "Testing track beer 2"], ["rating", 5], ["tracked", 1], ["user_id", 1], ["beer_id", 2], ["created_at", "2020-03-04 06:28:40.204946"], ["updated_at", "2020-03-04 06:28:40.204946"]]
---
  def create
    @review = Review.new(review_params)
    if @review.valid?
      @review.save

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 4]]
---
  def destroy
    @review = Review.find(params[:id])
    @review.destroy