app/views/reviews/edit.html.erb

Select a beer<br>
<%= f.collection_select(:beer_id, Beer.all, :id, :name) %>
---
SELECT "beers".* FROM "beers"

Select a user<br>
<%= f.collection_select(:user_id, User.all, :id, :username) %>
---
SELECT "users".* FROM "users"